In [1]:
# boston의 AGE 칼럼을 소수점 첫번째 자리에서 반올림하고 (int 형태로 변환)
# 가장 많은 비중을 차지하는 AGE 값과 그 개수를 출력하시오. (AGE 칼럼을 기준으로 그룹화하고, 그룹별 개수 계산)
# 즉 AGE 칼럼의 최빈값과 그 개수를 출력하시오. (최빈값 describe()?)

import pandas as pd
df = pd.read_csv(r"C:\Users\brian\Desktop\JUNSOO\bigdata\data\boston.csv")

In [2]:
df

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0,0.573,NaN,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [3]:
# 첫번째 방법!
print(df['AGE'])

print(round(df['AGE'],0)) #round 함수의 parameter 은 (df , 소숫점 n+1 번째 자리 반올림)
df_round = round(df['AGE'] , 0)
df_round.info()

0      65.2
1      78.9
2      61.1
3      45.8
4      54.2
       ...
501    69.1
502    76.7
503    91.0
504    89.3
505    80.8
Name: AGE, Length: 506, dtype: float64
0      65.0
1      79.0
2      61.0
3      46.0
4      54.0
       ...
501    69.0
502    77.0
503    91.0
504    89.0
505    81.0
Name: AGE, Length: 506, dtype: float64
<class 'pandas.core.series.Series'>
RangeIndex: 506 entries, 0 to 505
Series name: AGE
Non-Null Count  Dtype
--------------  -----
506 non-null    float64
dtypes: float64(1)
memory usage: 4.1 KB

In [5]:
#변수 데이터를 데이터 프레임으로 저장하겠다 (바로 grouby 를 사용할수 없음! ==> DataFrame 이전에는 Series 타입임 칼럼이 하나뿐!)
df_round = pd.DataFrame(df_round)
df_round

      AGE
0    65.0
1    79.0
2    61.0
3    46.0
4    54.0
..    ...
501  69.0
502  77.0
503  91.0
504  89.0
505  81.0

[506 rows x 1 columns]

In [6]:

print(df_round
      .groupby(['AGE'])['AGE']
      .count())
df_round_group = (
                df_round
                  .groupby(['AGE'])['AGE']
                  .count()
                  )
print(type(df_round_group)) #역시 series 데이터이기 때문에 pd.Dataframe() 으로 가공하기 쉽게 만들자!
df_round_group = pd.DataFrame(df_round_group)
print(type(df_round_group)) #DataFrame 으로 바뀐 모습!*

AGE
3.0       1
6.0       3
7.0       3
8.0       3
9.0       1
         ..
96.0     15
97.0     17
98.0     19
99.0     10
100.0    43
Name: AGE, Length: 91, dtype: int64
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [7]:
df_round_group.head()

     AGE
AGE
3.0    1
6.0    3
7.0    3
8.0    3
9.0    1

In [8]:
df_round_group.columns = ['COUNT'] ##2-2에서 칼럼을 새로 계산해서 추가한것과 이미 존재하는 칼럼에 이름을 부여하는 것은 구분하자!
                                    # 인덱싱 추가하면 칼럼 갯수가 들어가서
                                    # 한번 더 실행하면 오류나옴.. (칼럼갯수가 달라졌기 때문!)

In [9]:
df_round_group.head()

     COUNT
AGE
3.0      1
6.0      3
7.0      3
8.0      3
9.0      1

In [10]:
df_round_group = (df_round_group
                  .reset_index(drop = False)) #여러번 실행하지말자.. 계속 인덱싱해버림...
#or

#df_round_group.reset_index(drop = False , inplace = True)

In [11]:
df_round_group

      AGE  COUNT
0     3.0      1
1     6.0      3
2     7.0      3
3     8.0      3
4     9.0      1
..    ...    ...
86   96.0     15
87   97.0     17
88   98.0     19
89   99.0     10
90  100.0     43

[91 rows x 2 columns]

In [11]:
df_round_group.head()
df_round_group.info()

<class 'pandas.core.frame.DataFrame'>
Index: 91 entries, 90 to 0
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AGE     91 non-null     float64
 1   COUNT   91 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 2.1 KB

In [10]:
print(df_round_group
      .head(3))
df_round_group = (df_round_group
                  .sort_values(by = 'COUNT' , ascending = False))
print(df_round_group.head(3)) #최빈값이 0행0열(최빈값) , 0행1열(갯수)
print(df_round_group
      .iloc[0,0]
      ,df_round_group
      .iloc[0,1]) #답 도출!

   AGE  COUNT
0  3.0      1
1  6.0      3
2  7.0      3
      AGE  COUNT
90  100.0     43
88   98.0     19
87   97.0     17
100.0 43